# Pandas

Pandas is an open source library that is built on top of numpy library.It is python package that offers various data structure and operations for manpulating numeric data and time series.It is mainly popular for importing and analyzing data much easier.

# Why Pandas?

Pandas allow us to analyze huge data and make conclusions based on statistical theories.

Pandas clean messy data and make more readable.

Pandas plays a very important role in datascience and machine learning.

# What pandas can do?

 Pandas can create series. 

 Pandas can create data frame.

# Series

 Pandas in series is like a column in table.

 It is like one dimensional array holding data of any type.

In [1]:
# Import basic libraries 
import numpy as np
import pandas as pd

In [2]:
# create empty series
A=pd.Series()
print(A)

Series([], dtype: object)

In [3]:
# create Series with single element
B=pd.Series("Hello")
print(B)

0    Hello
dtype: object

In [4]:
# create Series using list 
colors=["blue","green","orange"]
Series=pd.Series(colors)
print(Series)

0      blue
1     green
2    orange
dtype: object

# What is difference between List and Series

List- In list is can store Square brackets [], Commas ,.

Series- In series can store huge amount of everything format specfied data type.

In [5]:
# create series of using tuple
tuple=(1000,2000,3000)
Series=pd.Series(tuple)
print(Series)

0    1000
1    2000
2    3000
dtype: int64

In [6]:
# create Series using dictionary 
dict={101: "John", 102: "Mary", 103: "Zara"}
data=pd.Series(dict)
print(data)

101    John
102    Mary
103    Zara
dtype: object

In [7]:
A=pd.Series(["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"])
print(A)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
5     Saturday
6       Sunday
dtype: object

In [8]:
# change index values
A.index=["Day1","Day2","Day3","Day4","Day5","Day6","Day7"]

In [9]:
A

Day1       Monday
Day2      Tuesday
Day3    Wednesday
Day4     Thursday
Day5       Friday
Day6     Saturday
Day7       Sunday
dtype: object

In [10]:
A[0]

C:\Users\chand\AppData\Local\Temp\ipykernel_19256\303350297.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  A[0]

'Monday'

In [11]:
A["Day2"]

'Tuesday'

In [12]:
A["Day7"]

'Sunday'

In [13]:
A["Day3"]

'Wednesday'

In [14]:
A[1:2]

Day2    Tuesday
dtype: object

In [15]:
A[2:4]

Day3    Wednesday
Day4     Thursday
dtype: object

In [16]:
A[5:7]

Day6    Saturday
Day7      Sunday
dtype: object

# Data Frame 

Data frame in pandas is a two dimensional data structure is data aligned in a tabular fashion rows and columns.

# Features of Data Frame

 Columns are of different data types.

 It will have labelled axes(Rows and Columns).

 We can access values, rows and columns.

 Can perform Arithmetic operations on row and columns.

In [17]:
# Syntax
# pd.DataFrame(data,index,columns)

In [18]:
# Create dataframe using nested list
list=[[1,2,3],[4,5,6],[7,8,9],[1,6,8]]
A=pd.DataFrame(list)
print(A)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
3  1  6  8

In [19]:
data=[["John",40],["Mary",50],["Zara",60]]
B=pd.DataFrame(data)
B

      0   1
0  John  40
1  Mary  50
2  Zara  60

In [20]:
data=[["John",40],["Mary",50],["Zara",60]]
B=pd.DataFrame(data,columns=["Name","Age"])
B

   Name  Age
0  John   40
1  Mary   50
2  Zara   60

In [21]:
data=[["John",40],["Mary",50],["Zara",60]]
B=pd.DataFrame(data,columns=["Name","Age"],index=[101,102,103])
B

     Name  Age
101  John   40
102  Mary   50
103  Zara   60

In [22]:
# create dataframe using dictionary
dict={"Name":["John","Mary","Zara"],"Age":[45,35,67],"Job":["HR","Manager","Analyst"],"Salary":[30000,40000,50000]}
data=pd.DataFrame(dict)
data

   Name  Age      Job  Salary
0  John   45       HR   30000
1  Mary   35  Manager   40000
2  Zara   67  Analyst   50000

In [23]:
dict={"Name":["John","Mary","Zara"],"Age":[45,35,67],"Job":["HR","Manager","Analyst"],"Salary":[30000,40000,50000]}
data=pd.DataFrame(dict,index=[101,102,103])
data

     Name  Age      Job  Salary
101  John   45       HR   30000
102  Mary   35  Manager   40000
103  Zara   67  Analyst   50000

# No of values in each columns should be same when we create data frame using dictionary

In [26]:
list=[['apple',40],['orange',60,120],['mango',40]]
A=pd.DataFrame(list,columns=["fruits","no_of_fruits","price_per_kilo"])
A

   fruits  no_of_fruits  price_per_kilo
0   apple            40             NaN
1  orange            60           120.0
2   mango            40             NaN

# Nan/None/Null are the missing values

In [27]:
# How to sort data
data

     Name  Age      Job  Salary
101  John   45       HR   30000
102  Mary   35  Manager   40000
103  Zara   67  Analyst   50000

In [28]:
data.sort_values("Salary")

     Name  Age      Job  Salary
101  John   45       HR   30000
102  Mary   35  Manager   40000
103  Zara   67  Analyst   50000

In [35]:
data.sort_values("Salary",ascending=False)
data

     Name  Age      Job  Salary
101  John   45       HR   30000
102  Mary   35  Manager   40000
103  Zara   67  Analyst   50000

In [39]:
data

     Name  Age      Job  Salary
101  John   45       HR   30000
102  Mary   35  Manager   40000
103  Zara   67  Analyst   50000

In [41]:
# To sort in ascending by default it sorts in ascending or else just give ascending=True
# To sort indescending  give ascending=False
# To make permanent change inplace= True
# How to create copy of data
# Copy it helps in creating duplicate of original data